%--------------------------------------------------------------------------
%              读取原始数据，调用regress函数作多元线性回归
%--------------------------------------------------------------------------

xydata = xlsread('examp19_3_1.xls');
y = xydata(:, 2);
X = xydata(:, 3:7);
xdata = [ones(size(X, 1), 1), X];
[b, bint, r, rint, s] = regress(y, xdata);

head1 = {'系数的估计值','估计值的95%置信下限','估计值的95%置信上限'};
[head1; num2cell([b, bint])]

head2 = {'判定系数','F统计量的观测值','检验的p值','误差方差的估计值'};
[head2; num2cell(s)]