%--------------------------------------------------------------------------
%              读取原始数据，调用regress函数作一元线性回归
%--------------------------------------------------------------------------

%*****************************读取数据，绘制散点图***************************
ClimateData = xlsread('examp19_1_1.xls');
x = ClimateData(:, 1);
y = ClimateData(:, 5);
plot(x, y, 'k.', 'Markersize', 15)
xlabel('年平均气温(x)')
ylabel('全年日照时数(y)')


%*****************************计算相关系数**********************************
R = corrcoef(x, y)


%***********************调用regress函数作一元线性回归************************
xdata = [ones(size(x, 1), 1), x];
[b, bint, r, rint, s] = regress(y, xdata);
yhat = xdata*b;

head1 = {'系数的估计值','估计值的95%置信下限','估计值的95%置信上限'};
[head1; num2cell([b, bint])]

head2 = {'y的真实值','y的估计值','残差','残差的95%置信下限','残差的95%置信上限'};
[head2; num2cell([y, yhat, r, rint])]

head3 = {'判定系数','F统计量的观测值','检验的p值','误差方差的估计值'};
[head3; num2cell(s)]


%*****************************绘制回归直线**********************************
plot(x, y, 'k.', 'Markersize', 15)
hold on
plot(x, yhat, 'linewidth', 3)
xlabel('年平均气温(x)')
ylabel('全年日照时数(y)')
legend('原始散点','回归直线');



%--------------------------------------------------------------------------
%              剔除异常数据，重新调用regress函数作一元线性回归
%--------------------------------------------------------------------------

%*******************************残差分析************************************
figure
rcoplot(r,rint)

%******************剔除异常数据，重新计算相关系数矩阵*************************
xt = x(y<3000 & y>1250);
yt = y(y<3000 & y>1250);
figure
plot(xt, yt, 'ko')
xlabel('年平均气温(x)')
ylabel('全年日照时数(y)')
Rt = corrcoef(xt, yt)

%**********************重新调用regress函数作一元线性回归*********************
xtdata = [ones(size(xt, 1), 1),  xt];
[b, bint, r, rint, s] = regress(yt, xtdata);
b
s
ythat = xtdata*b;

%*************************绘制两次回归分析的回归直线*************************
figure;
plot(x, y, 'ko');
hold on;
[xsort, id1] = sort(x);
yhatsort = yhat(id1);
plot(xsort, yhatsort, 'r--','linewidth',3);
plot(xt, ythat, 'linewidth', 3);
legend('原始数据散点','原始数据回归直线','剔除异常数据后回归直线')
xlabel('年平均气温(x)');
ylabel('全年日照时数(y)');